pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/SAPH_367.0.xml
<module id="SAPH" HW_revision="367.0">
    <register id="SAPHIIDX" width="16" offset="0x0" internal="0" description="Interrupt Index">
        <bitfield id="IIDX" description="This register provides the highest priority enabled interrupt index." begin="3" end="1" width="3" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="no interrupts pending"/>
            <bitenum id="DATAERR" value="0x1" description="This interrupt indicates that either WINHI interrupt or WINLO interrupt has occurred in SDHS."/>
            <bitenum id="TMFTO" value="0x2" description="This interrupt is valid when ASQ is activcve (auto mode). The interrupt indicates that the time counter in ASQ has reached to TIMEMARK_F (timeout)."/>
            <bitenum id="SEQDN" value="0x3" description="The interrupt occurs when ASQ completes all of the measurements programmed in ASCTL0.PNGCNT. For example, when ASCTL0.PNGCNT = 3, total four measurements are performed. The interrupt indicates that all of the four measurements have been completed.  Note: After the ASQ is triggered, if the current measurement is interrupted by entering debug halt mode (UUPS.RIS.STPBYDB = 1), the SEQDN interrupt is also reported."/>
            <bitenum id="PNGDN" value="0x4" description="The interrupt occurs when the PPG completes pulse generation."/>
        </bitfield>
    </register>
    <register id="SAPHMIS" width="16" offset="0x2" internal="0" description="Masked Interrupt Satus">
        <bitfield id="DATAERR" description="This interrupt indicates that either WINHI interrupt or WINLO interrupt has occurred in SDHS." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="TMFTO" description="This bit indicates a TIMEMARK F (timeout) event has happened." begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQDN" description="The interrupt occurs when ASQ completes all of the measurements programmed in ASCTL0.PNGCNT. For example, when ASCTL0.PNGCNT = 3, total four measurements are performed. The interrupt indicates that all of the four measurements have been completed.  Note: After the ASQ is triggered, if the current measurement is interrupted by entering debug halt mode (UUPS.RIS.STPBYDB = 1), the SEQDN interrupt is also reported." begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PNGDN" description="The interrupt occurs when the PPG completes pulse generation." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SAPHRIS" width="16" offset="0x4" internal="0" description="Raw Interrupt Status">
        <bitfield id="DATAERR" description="This interrupt indicates that either WINHI interrupt or WINLO interrupt has occurred in SDHS." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="TMFTO" description="This bit indicates a TIMEMARK F (timeout) event has happened." begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQDN" description="The interrupt occurs when ASQ completes all of the measurements programmed in ASCTL0.PNGCNT. For example, when ASCTL0.PNGCNT = 3, total four measurements are performed. The interrupt indicates that all of the four measurements have been completed.  Note: After the ASQ is triggered, if the current measurement is interrupted by entering debug halt mode (UUPS.RIS.STPBYDB = 1), the SEQDN interrupt is also reported." begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PNGDN" description="The interrupt occurs when the PPG completes pulse generation." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SAPHIMSC" width="16" offset="0x6" internal="0" description="Interrupt Mask">
        <bitfield id="DATAERR" description="This bit enables the DATAERR interrupt." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TMFTO" description="This bit enables the TIMEMARK F (timeout) interrupt." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQDN" description="This bit enables the SEQDN interrupt" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PNGDN" description="This bit enables the PNGDN interrupt" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPHICR" width="16" offset="0x8" internal="0" description="Interrupt Clear">
        <bitfield id="DATAERR" description="Writing one this bit to clear the pending DATAERR interrupt." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TMFTO" description="Writing one this bit to clear the pending TIMEMARK F (timeout) interrupt" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQDN" description="Writing one this bit to clear the pending SEQDN interrupt." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PNGDN" description="Writing one this bit to clear the pending PNGDN interrupt." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPHISR" width="16" offset="0xA" internal="0" description="Interrupt Set">
        <bitfield id="DATAERR" description="Writing one this bit generates a DATAERR interrupt by software." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TMFTO" description="Writing one this bit to generate a TIMEMARK F (timeout) interrupt by software." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQDN" description="Writing one this bit to generate a SEQDN interrupt by software." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PNGDN" description="Writing one this bit to generate a PNGDN interrupt by software." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPHDESCLO" width="16" offset="0xC" internal="0" description="Module-Descriptor Low Word">
        <bitfield id="MINREV" description="Minor Revision" begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJREV" description="Major Revision" begin="7" end="4" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number" begin="11" end="8" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Version" begin="15" end="12" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="SAPHDESCHI" width="16" offset="0xE" internal="0" description="Module-Descriptor High Word">
    </register>
    <register id="SAPHKEY" width="16" offset="0x10" internal="0" description="Key">
    </register>
    <register id="SAPHOCTL0" width="16" offset="0x12" internal="0" description="Physical Interface Output Control #0">
        <bitfield id="CH0OE" description="CH0_OUT Enable. When OSEL.PCH0SEL =0, this bit enables the output CH0 when set to 1. When OSEL.PCH0SEL != 0, this bit is invalid." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CH0OE_0" value="0x0" description="Ch0 Output is HiZ"/>
            <bitenum id="CH0OE_1" value="0x1" description="CH0 Output is driving"/>
        </bitfield>
        <bitfield id="CH1OE" description="CH1_OUT Enable. When OSEL.PCH1SEL =0, this bit enables the output CH1 when set to 1. When OSEL.PCH1SEL != 0, this bit is invalid." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CH1OE_0" value="0x0" description="Ch1 Output is HiZ"/>
            <bitenum id="CH1OE_1" value="0x1" description="CH1 Output is driving"/>
        </bitfield>
        <bitfield id="CH0OUT" description="CH0_OUT Value. When OSEL.PCH0SEL =0 and OCTL0.CH0OE=1, this bit represents the logical value on the CH0 terminal.  0 = low 1 = high" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CH0OUT_0" value="0x0" description="Ch0 is set to low signal"/>
            <bitenum id="CH0OUT_1" value="0x1" description="Ch0 is set to high signal"/>
        </bitfield>
        <bitfield id="CH1OUT" description="CH1_OUT Value. When OSEL.PCH1SEL =0 and OCTL0.CH1OE=1, this bit represents the logical value on the CH1 terminal.  0 = low 1 = high" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="CH1OUT_0" value="0x0" description="Ch1 is set to low signal"/>
            <bitenum id="CH1OUT_1" value="0x1" description="Ch1 is set to high signal"/>
        </bitfield>
    </register>
    <register id="SAPHOCTL1" width="16" offset="0x14" internal="0" description="Physical Interface Output Control #1">
        <bitfield id="CH0TERM" description="CH0 termination switch (SWG0) enable.  When OSEL.PCH0SEL =0, this bit controls the SWG0 switch.  0 = SWG0 is off.   1 = SWG0 is on. The CH0_OUT is disabled and connected to PVSS via SWG0 switch. No need to change OCTL0.CH0OE status." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CH0TERM_0" value="0x0" description="CH0 Output is defined by CH0OUT and CH0OE"/>
            <bitenum id="CH0TERM_1" value="0x1" description="CH0 Output is set low with termination strength"/>
        </bitfield>
        <bitfield id="CH1TERM" description="CH1 termination switch (SWG1) enable.  When OSEL.PCH1SEL =0, this bit controls the SWG1 switch.  0 = SWG1 is off.   1 = SWG1 is on. The CH1_OUT is disabled and connected to PVSS via SWG1 switch. No need to change OCTL0.CH1OE status." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CH1TERM_0" value="0x0" description="CH1 Output is defined by CH1OUT and CH1OE"/>
            <bitenum id="CH1TERM_1" value="0x1" description="CH1 Output is set low with termination strength"/>
        </bitfield>
        <bitfield id="CH0FP" description="DRV0 (output driver on the CH0_OUT) full strength enable.  0 = The DRV0 output impedance is deterimed by CH0PUT and CH0PDT registers.  1 = The DRV0 has lowest output impedance." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CH0FP_0" value="0x0" description="Ch0 Output is set to normal strength"/>
            <bitenum id="CH0FP_1" value="0x1" description="Ch0 Output is set to maximum strength"/>
        </bitfield>
        <bitfield id="CH1FP" description="DRV1 (output driver on the CH1_OUT) full strength enable.  0 = The DRV1 output impedance is deterimed by CH1PUT and CH1PDT registers.  1 = The DRV1 has lowest output impedance." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="CH1FP_0" value="0x0" description="Ch1 Output is set to normal strength"/>
            <bitenum id="CH1FP_1" value="0x1" description="Ch1 Output is set to maximum strength"/>
        </bitfield>
    </register>
