pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/SAPH_367.0.xml
    <register id="SAPHOSEL" width="16" offset="0x16" internal="0" description="Physical Interface Output Function Select">
        <bitfield id="PCH0SEL" description="Output functional select for CH0_OUT." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="GPIO" value="0x0" description="CH0_OUT is used as a GPO pin. It is controlled by OCTL0.CH0OUT and OCTL0.CH0OE."/>
            <bitenum id="PPGSE" value="0x1" description="CH0_OUT is driven by the PPG."/>
            <bitenum id="PCH0SEL_2" value="0x2" description="CH0_OUT is driven by the PPG as differential output along with CH1_OUT. (CH0_OUT and CH1_OUT are alwasy opposite polarity)"/>
            <bitenum id="PCH0SEL_3" value="0x3" description="CH0_OUT is used as a GPO pin. It is controlled by OCTL0.CH0OUT and OCTL0.CH0OE."/>
        </bitfield>
        <bitfield id="PCH1SEL" description="Output functional select for CH0_OUT." begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="GPIO" value="0x0" description="CH1_OUT is used as a GPO pin. It is controlled by OCTL0.CH1OUT and OCTL0.CH1OE."/>
            <bitenum id="PPGSE" value="0x1" description="CH1_OUT is driven by the PPG."/>
            <bitenum id="PCH1SEL_2" value="0x2" description="CH1_OUT is driven by the PPG as differential output along with CH0_OUT. (CH0_OUT and CH1_OUT are alwasy opposite polarity)"/>
            <bitenum id="PCH1SEL_3" value="0x3" description="CH1_OUT is used as a GPO pin. It is controlled by OCTL0.CH1OUT and OCTL0.CH1OE."/>
        </bitfield>
    </register>
    <register id="SAPHCH0PUT" width="16" offset="0x20" internal="0" description="Channel 0 Pull UpTrim Register">
        <bitfield id="CH0PUT" description="DRV0 pull up trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPHCH0PDT" width="16" offset="0x22" internal="0" description="Channel 0 Pull DownTrim Register">
        <bitfield id="CH0PDT" description="DRV0 pull down trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPHCH0TT" width="16" offset="0x24" internal="0" description="Channel 0 Termination Trim">
        <bitfield id="CH0TT" description="SWG0 trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPHCH1PUT" width="16" offset="0x26" internal="0" description="Channel 1 Pull UpTrim">
        <bitfield id="CH1PUT" description="DRV1 pull up trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPHCH1PDT" width="16" offset="0x28" internal="0" description="Channel 1 Pull DownTrim">
        <bitfield id="CH1PDT" description="DRV1 pull down trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPHCH1TT" width="16" offset="0x2A" internal="0" description="Channel 1 Termination Trim">
        <bitfield id="CH1TT" description="SWG1 trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPHMCNF" width="16" offset="0x2C" internal="0" description="Mode Configuration Register">
        <bitfield id="LPBE" description="LPBE, low power bias mode enable. This bit enables the low power bias operation mode. The selection of the operation mode shall only be changed while the PSQ is in OFF state (changes during other states of the PSQ causes corrupt measurement results and irregular triggers of sub modules ba ASQ)" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="LPBE_0" value="0x0" description="For manual bias mode and regular ASQ bias mode. In this configuration the user controls by the ASQBSW has full control over the TxBias and RxBias switches."/>
            <bitenum id="LPBE_1" value="0x1" description="Low power bias mode. In this mode the ASQ uses the CHxEBSW and PGABSW as auxiliary values to achieve faster channel setting on reactive input loads. The ASQ has full controls over the bias switch multiplexer."/>
        </bitfield>
        <bitfield id="RSV1" description="Reserved for future use" begin="10" end="9" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="CPEO" description="This bit enables the charge pump of the input multiplexer." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CPEO_0" value="0x0" description="Charge pump is turned on by SDHS and ASQ related requests only."/>
            <bitenum id="CPEO_1" value="0x1" description="Charge pump is turned on regardless of SDHS and ASQ related charge pump requests."/>
        </bitfield>
        <bitfield id="RSV0" description="Reserved for future use" begin="3" end="2" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="BIMP" description="These bits define the impedance of the buffers for RxBias and TxBias. While for resistive loads the lowest impedance shows the fastest settling; is this not the case for reactive loads." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="BIMP_0" value="0x0" description="200 Ohms buffer impedance for RxBias and TxBias"/>
            <bitenum id="BIMP_1" value="0x1" description="600 Ohms buffer impedance for RxBias and TxBias"/>
            <bitenum id="BIMP_2" value="0x2" description="1200 Ohms buffer impedance for RxBias and TxBias (default)"/>
            <bitenum id="BIMP_3" value="0x3" description="2800 Ohms buffer impedance for RxBias and TxBias"/>
        </bitfield>
    </register>
