pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/SAPH_367.0.xml
    <register id="SAPHATM_A" width="16" offset="0x6E" internal="0" description="A-SEQ start to 1st ping">
    </register>
    <register id="SAPHATM_B" width="16" offset="0x70" internal="0" description="ASQ start to ADC arm">
    </register>
    <register id="SAPHATM_C" width="16" offset="0x72" internal="0" description="Count for the TIMEMARK C Event">
    </register>
    <register id="SAPHATM_D" width="16" offset="0x74" internal="0" description="ASQ start to ADC trig">
    </register>
    <register id="SAPHATM_E" width="16" offset="0x76" internal="0" description="ASQ start to restart">
    </register>
    <register id="SAPHATM_F" width="16" offset="0x78" internal="0" description="ASQ start to timeout">
    </register>
    <register id="SAPHTBCTL" width="16" offset="0x7A" internal="0" description="Time Base Control">
        <bitfield id="TCLR" description="The ASQ time counter clear. Writing '1' to this bit clears the the counter value. The counter must be stopped prior to be cleared. This bit is self cleared. TSTOP, TSTART, and TCLR bits are offerred for only debugging purpose. It is not recommend to use this bit while ASQ is active. Note: This bit is write only. Reading always returns with zero." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TSTART" description="The ASQ time counter start. Writing '1' to this bit starts the counter. This bit is self cleared. TSTOP, TSTART, and TCLR bits are offerred for only debugging purpose. It is not recommend to use this bit while ASQ is active. Note: This bit is write only. Reading always returns with zero." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TSTOP" description="The ASQ time counter stop. Writing '1' to this bit stops the counter. This bit is self cleared. TSTOP, TSTART, and TCLR bits are offerred for only debugging purpose. It is not recommend to use this bit while ASQ is active. Note: This bit is write only. Reading always returns with zero." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PSSV" description="ASQ pre-scaler shift. The value written to the PSSV bits shifts the start point of the ASQ's pre-scaler. Note that the value only affects the first cycle of the pre-scaler.   0 = No shift 1 = The pre-scaler starts 1 clock later  2 = The pre-scaler starts 2 clocks later  ... 15 = The pre-scaler starts 15 clocks later" begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPHATIMLO" width="16" offset="0x7C" internal="0" description="Acquisition Timer Low Part">
    </register>
    <register id="SAPHATIMHI" width="16" offset="0x7E" internal="0" description="Acquisition Timer High Part">
        <bitfield id="ATIMHI" description="ASQ Timer Counter high part. The reading this register returns the counter value [19:16]." begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
    </register>
</module>
